"""
โจทย์ 1: เครื่องคำนวณอย่างปลอดภัย 
เขียนโปรแกรมรับตัวเลข 2 จำนวนและตัวดำเนินการ 1ตัว ได้แก่+ - * / แล้วแสดงผลลัพธ์
โปรแกรมต้องจัดการกรณีต่อไปนี้
*ผู้ใช้กรอกข้อมูลที่ไม่ใช่ของตัวเลข #ValueError
*ผู้ใช้ เลือกตัวดำเนินการอื่นนอกเหนือจาก + - * / raise ValueError
*ผู้ใช้พยายามหารด้วยศูนย์ #ZeroDivisionError
*โปรแกรมต้องแสดง จบการทำงาน เสมอด้วย finally

ตัวอย่างผลลัพธ์ที่คาดหวัง
ตัวเลขที่1: 10
ตัวเลขที่2: 0
เครฺ็องหมาย (+,-,*,/): /

ไม่สามารถหารด้วยศูนย์ได้
จบการทำงาน

มันไม่ใช่โค้ดทั่วไป มันพิเศษมันคือความเสี่ยง

"""

try:
    num1 = float(input("ตัวเลขที่ 1: "))
    num2 = float(input("ตัวเลขที่ 2: "))
    op = input("เครื่องหมาย (+,-,*,/): ")

    result = 0 
    if op == '+':
        result = num1 + num2
    elif op == '-':
        result = num1 - num2
    elif op == '*':
        result = num1 * num2
    elif op == '/':
        result = num1 / num2
    else:
        raise ValueError("รันเฉพาะ + - * / เท่านั้น")

    print(f"{num1} {op} {num2} = {result}")

except ValueError:
    print("ต้องเป็นตัวเลขเท่านั้น")

except ZeroDivisionError:
    print("ไม่สามารถหารด้วยศูนย์ได้")

finally:
    print("จบการทำงาน")
